# 1. Напишите программу, которая принимает строку от пользователя
# и разбивает ее на отдельные слова.
# Затем программа должна объединить слова в обратном порядке с
# использованием метода join(). Используйте динамический массив и
# методы для работы со строками. Выведите результат на экран с
# помощью команды print.
#
#
# Пример вывода:
#
#
# Введите предложение: Программирование это интересно и полезно
#
# Перевернутое предложение: полезно и интересно это Программирование

def hw14_1_input():
    return input('Enter sentence: ')


def hw14_1(sentence: str):
    list_sentence = sentence.split()
    return ' '.join(list_sentence[::-1])

# 2. Напишите программу, которая принимает список чисел от пользователя и
# добавляет каждое число в динамический массив.
# Затем программа должна принимать новое число от пользователя и
# добавлять его в динамический массив до тех пор, пока пользователь
# не введет команду "Выход". Используйте метод append() для добавления
# элементов в динамический массив и условный оператор для проверки
# команды "Выход". Выведите итоговый динамический массив на экран с
# помощью команды print.
#
#
# Пример вывода:
#
#
# Введите число (или 'Выход' для завершения): 1
# Введите число (или 'Выход' для завершения): 2
# Введите число (или 'Выход' для завершения): Выход
#
# Динамический массив: [1, 2]

def hw14_2():
    list_numbers = []
    while True:
        number = input('Enter number (or "Exit" to finish): ')
        if number.lower() == 'exit':
            break
        if number.isdigit():
            list_numbers.append(number)

    return list_numbers


if __name__ == '__main__':
    sentence = hw14_1_input()
    if len(sentence) == 0:
        sentence = 'Programming is interesting and useful'
    print(f'Reversed sentence: {hw14_1(sentence)}')

    print(f'Dynamic array: {hw14_2()}')
