from math import pi

'''
1. Давайте создадим простой калькулятор. Напишите программу, которая запрашивает у пользователя два целых числа и выполняет следующие действия:
- Вычисляет сумму и выводит результат.
- Вычисляет разность и выводит результат (первое число минус второе число).
- Вычисляет произведение и выводит результат.
- Вычисляет частное (результат деления первого числа на второе) и выводит результат.
- Вычисляет остаток от деления первого числа на второе и выводит результат.
- Возводит первое число в степень второго числа и выводит результат.

Пример вывода:
Введите первое число: 5
Введите второе число: 2

Сумма: 7
Разность: 3
Произведение: 10
Частное: 2.5
Остаток от деления: 1
Первое число в степени второго числа: 25
'''


def hw3_1(x,y):
    results = [
        f'Сумма: {int(x) + int(y)}',
        f'Разность: {int(x) - int(y)}',
        f'Произведение: {int(x) * int(y)}',
        f'Частное: {int(x) / int(y)}',
        f'Остаток от деления: {int(x) % int(y)}',
        f'Первое число в степени второго числа: {int(x) ** int(y)}'
    ]
    return '\n'.join(results)


'''Есть круглая арена цирка, 
нам известен ее радиус, 
нужно подобрать покрытие 
для этой арены, чтобы это сделать 
необходимо узнать длину и 
площадь окружности. 

Напишите программу, которая 
запрашивает у пользователя 
радиус окружности и выполняет 
следующие действия:
- Вычисляет длину окружности по формуле 2 * pi * r, где pi – математическая константа (примерно равна 3.14159), а r – радиус окружности. Выводит результат.
- Вычисляет площадь окружности по формуле pi * r^2, где pi – математическая константа, а r – радиус окружности. Выводит результат.

Пример вывода:
Введите радиус окружности: 4.5
Длина окружности: 28.274333882308138
Площадь окружности: 63.61725123519331'''


def hw3_2(r):
    results = [
        f'Длина окружности: {2 * pi * float(r)}',
        f'Площадь окружности: {pi * float(r) ** 2}'
    ]
    return '\n'.join(results)

'''
3. Географ хочет находить расстояние 
между двумя точками на карте. 
Напишите для него программу, 
которая запрашивает у пользователя 
координаты двух точек в двумерном 
пространстве (x1, y1) и (x2, y2), 
а затем вычисляет и выводит расстояние 
между этими точками по формуле:
distance = sqrt((x2 - x1)^2 + (y2 - y1)^2)
где sqrt - функция извлечения 
квадратного корня. 
Не используйте встроенную математическую 
функцию sqrt для вычисления корня. 
Не забывайте, что sqrt(x)==x**0.5. 
Результат должен быть выведен с 
помощью команды print.

Пример вывода:
Введите координаты первой точки (x1, y1): 2, 3
Введите координаты второй точки (x2, y2): 5, 7
Расстояние между точками: 5.0'''


def hw3_3(x1,y1, x2,y2):
    distance = (
            ((int(x2) - int(x1)) ** 2 +
             (int(y2) - int(y1)) ** 2) ** 0.5)
    return f'Расстояние между точками: {distance}'


if __name__ == "__main__":
    print('\n-Homework 1')
    x = input('Введите первое число: ')
    y = input('Введите второе число: ')
    print(hw3_1(x, y))

    print(f'\n-Homework 2')
    r = input('Введите радиус окружности: ')
    print(hw3_2(r))

    print(f'\n-Homework 3')
    x1, y1 = input('Введите координаты первой точки (x1, y1): ').split(',')
    x2, y2 = input('Введите координаты второй точки (x2, y2): ').split(',')
    print(hw3_3(x1, y1, x2, y2))
