'''
1. Домашнее задание:
 Даны формулы: ¬((A ∨ B) ∧ (C ∨ D)) и ((¬A ∧ ¬B) ∨ (¬C ∧ ¬D)). Используя закон Де Моргана, докажите, что эти формулы эквивалентны.

2. Напишите программу, которая запрашивает у пользователя два логических значения (True или False) и выводит результаты следующих логических операций:
- Логическое И (and) между двумя значениями.
- Логическое ИЛИ (or) между двумя значениями.
- Логическое НЕ (not) для каждого значения.
- Результат сравнения двух значений на равенство.
- Результат сравнения двух значений на неравенство.

Результаты должны быть выведены с помощью команды print.

Пример вывода:
Введите первое логическое значение (True или False): True
Введите второе логическое значение (True или False): False

Результат логического И: False
Результат логического ИЛИ: True
Результат логического НЕ (для первого значения): False
Результат логического НЕ (для второго значения): True
Результат сравнения на равенство: False
Результат сравнения на неравенство: True
'''


def hw4_1():
    result = [
        f'¬((A ∨ B) ∧ (C ∨ D)) и((¬A ∧ ¬B) ∨ (¬C ∧ ¬D))',
        f'первой формула: ¬((A ∨ B) ∧ (C ∨ D))',
        f'конъюнкции: ¬((A ∨ B) ∧ (C ∨ D)) = ¬(A ∨ B) ∨ ¬(C ∨ D)',
        f'дизъюнкций: ¬(A ∨ B) = ¬A ∧ ¬B и ¬(C ∨ D) = ¬C ∧ ¬D',
        f'Подставим обратно ¬(A ∨ B) ∨ ¬(C ∨ D) = (¬A ∧ ¬B) ∨ (¬C ∧ ¬D)',
        f'мы доказали, что формула ¬((A ∨ B) ∧ (C ∨ D)) эквивалентна',
        f'формуле((¬A ∧ ¬B) ∨ (¬C ∧ ¬D)).',
    ]

    return '\n'.join(result)


def str_to_bool(val):
    return val.lower() in ['true', '1']


def hw4_2_input():
    val1 = input('Enter first logical value (True или False): ')
    val2 = input('Enter second logical value (True или False): ')
    return str_to_bool(val1), str_to_bool(val2)


def hw4_2_print(val1, val2):
    result = [
        f'Результат логического И: {val1 and val2}',
        f'Результат логического ИЛИ: {val1 or val2}',
        f'Результат логического НЕ (для первого значения): {not val1}',
        f'Результат логического НЕ (для второго значения): {not val2}',
        f'Результат сравнения на равенство: {val1 == val2}',
        f'Результат сравнения на неравенство: {val1 != val2}',
    ]

    return '\n'.join(result)


if __name__ == '__main__':
    print(hw4_1())
    print('\n')
    val1, val2 = hw4_2_input()
    # print(f'val1: {val1}, type {type(val1)}, val2: {val2}, type {type(val2)}')
    print(hw4_2_print(val1, val2))
