# Напишите программу, которая запрашивает у пользователя
# натуральное десятичное число и выводит его двоичное представление.
# Реализуйте алгоритм перевода числа в двоичную систему счисления,
# используя основные концепции представления чисел
# (подсказка: через деление с остатком).
# Выведите полученное представление числа на экран.
#
#
# Пример вывода:
#
# Введите натуральное десятичное число: 123
#
# Двоичное представление числа: 1111011

def hw_71(num):
    binary = ''
    while num > 0:
        binary = str(num % 2) + binary
        num = num // 2
    return binary


# Напишите программу, принимающую число с плавающей точкой и
# округляющую его до целого числа в соответствии с правилами
# школьной математики. Использовать модуль math и методы
# из него нельзя. Учесть, что программа должна корректно
# работать с отрицательными числами.
#
#
# Пример вывода:
#
# Введите вещественное число: -3.14
#
# Округленное значение: -3
def hw_72(num):
    return int(num + 0.5) if num > 0 else int(num - 0.5)



if __name__ == '__main__':
    num = int(input('Enter a natural decimal number: '))
    print(f'Binary representation of the number: {hw_71(num)}')
    num = float(input('Enter a float number: '))
    print(f'Rounded value: {hw_72(num)}')
